{
    "9th": {
        "Science": [
            "12",
            "Question Paper Design (Theory)"
        ],
        "Social": [
            "Subtopic 3. The inter- war economy",
            "Subtopic 4. Rebuilding of world economy: the post war era.",
            "Inter disciplinary Project with chapter 7 of Geography: Lifelines of National Economy and",
            "chapter 4 of Economics: Globalisation and the Indian Economy",
            "Refer Annexure III B",
            "Learning outcome- The students will be able to",
            "⮚ Summarise the changes that transformed the world in different areas.",
            "⮚ Depict the global interconnectedness from the Pre-modern to the present day.",
            "⮚ Enumerate the destructive impact of colonialism on the livelihoods of colonised people.",
            "Chapter 4-The Age of Industrialisation",
            "Learning outcome- The students will be able to",
            " Enumerate economic, political, social features of Pre and Post Industrialization.",
            " Analyse and infer how the industrialization impacted colonies with specific focus on India",
            "Chapter 5. Print culture and the Modern World",
            "Learning Outcome- The students will be able to",
            "⮚ Enumerate the development of Print from its beginnings in East Asia to its expansion in",
            "Europe and India.",
            "⮚ Compare and contrast the old tradition of handwritten manuscripts versus print technology.",
            "⮚ Summarise the role of Print revolution and its impact",
            "14",
            "Geography: Contemporary India – II",
            "Chapter 1- Resources and Development",
            "Learning Outcome- The students will be able to",
            " Enumerates how the resources are interdependent, justify how planning is essential in",
            "judicious utilisation of resources and the need to develop them in India.",
            "⮚ Infer the rationale for development of resources.",
            "⮚ Analyse and evaluate data and information related to non-optimal land, utilization in India",
            "⮚ Suggest remedial measures for optimal utilization of underutilized resources",
            "Chapter 2- Forest and Wildlife Resources",
            "Learning Outcome- The students will be able to",
            "⮚ Examine the importance of conserving forests and wildlife and their interdependency in",
            "maintaining the ecology for the sustainable development of India.",
            "⮚ Analyse the role of grazing and wood cutting in the development and degradation",
            "⮚ Summarise the reasons for conservation of biodiversity under sustainable development.",
            "⮚ Discuss how developmental works, grazing wood cutting have impacted the forests",
            "⮚ Use art integration to summarise and present the reasons for conservation of biodiversity in",
            "India under sustainable development.",
            "Chapter 3-Water Resources",
            "Learning Outcome- The students will be able to",
            "⮚ Examine the reasons for conservation of water resource in India.",
            "⮚ Analyse and infer how the multipurpose projects are supporting the requirement of water.",
            "Chapter 4- Agriculture",
            "Learning Outcome",
            "⮚ Examine the crucial role played by agriculture in our economy and society.",
            "⮚ Analyse the challenges faced by the farming community in India.",
            "⮚ Identifies various aspects of agriculture, including crop production, types of farming etc.",
            "Chapter 5- Minerals and Energy Resources",
            "Learning Outcome- The students will be able to",
            " Differentiates between the conventional and nonconventional sources of energy.",
            " Analyses the importance of minerals and natural resources for economic development of",
            "the country. Suggests strategies for sustainable use of natural resources",
            "Chapter 6-Manufacturing Industries",
            "Learning Outcome- The students will be able to",
            "⮚ Enumerate the impact of manufacturing industries on the environment and develop strategies",
            "for sustainable development of the manufacturing sector.",
            "⮚ Differentiate between various types of manufacturing industries based on their input materials,",
            "processes, and end products, and analyse their significance in the Indian economy.",
            "⮚ Analyse the relation between the availability of raw material and location of the industry",
            "15",
            "Chapter 7- Life Lines of National Economy",
            "Interdisciplinary project with chapter 3 of History: The making of a Global world and chapter 4 of",
            "Economics: Globalisation and the Indian Economy",
            "Learning Outcome-Refer Annexure III-B",
            "Political Science: Democratic Politics - II",
            "Chapter 1- Power – sharing",
            "Learning Outcome- The students will be able to",
            "⮚ Enumerate the need for power sharing in democracy.",
            "⮚ Analyse the challenges faced by countries like Belgium and Sri Lanka ensuring effective",
            "power sharing.",
            "⮚ Compare and contrast the power sharing of India with Sri Lanka and Belgium.",
            "⮚ Summarise the purpose of power sharing in preserving the unity and stability of a country",
            "Chapter 2-Federalism",
            "Learning Outcome- The students will be able to",
            "⮚ Infer how federalism is being practised in India.",
            "⮚ Analyse the policies and politics that has strengthened federalism in practice.",
            "Chapter 3- Gender, Religion and Caste",
            "Learning Outcome- The students will be able to",
            "⮚ Examine the role and differences of Gender, religion and Caste in practicing Democracy.",
            "⮚ Analyse that different expressions based on the differences, are healthy or not in a democracy",
            "Chapter 4- Political Parties",
            "Learning Outcome- The students will be able to",
            "⮚ Understand the process of parties getting elected.",
            "⮚ Know the significance of the right to vote and exercise the duties as citizens of a nation.",
            "⮚ Examine the role, purpose and no. of Political Parties in Democracy.",
            "Chapter 5- Outcomes of Democracy",
            "Learning Outcome- The students will be able to",
            "⮚ Enumerates how the success of democracy depends on quality of government, economic",
            "well- being, inequality, social differences, conflict, freedom and dignity.",
            "Economics: Understanding Economic Development",
            "Chapter- 1. Development",
            "Learning Outcome- The students will be able to",
            "⮚ Enumerate and examine the different processes involved in setting developmental Goals.",
            "⮚ Analyse and infer how the per capita income depicts the economic condition of the nation.",
            "16",
            "⮚ Evaluate the development goals with reference to their efficacy, implemental strategies,",
            "relevance to current requirements of the nation.",
            "⮚ Compare the per capita income of some countries and infer reasons for the variance.",
            "⮚ Analyse the multiple perspectives on the need of development.",
            "Chapter 2- Sectors of the Indian Economy",
            "Learning Outcome- The students will be able to",
            "⮚ Analyse and infer how the economic activities in different sectors contribute to the overall",
            "growth and development of the Indian economy.",
            "⮚ Propose solutions to identified problems in different sectors based on their understanding.",
            "⮚ Summarise how the organised and unorganised sectors are providing employment",
            "⮚ Enumerate the role of the unorganised sector in impacting Per Capita Income currently and",
            "propose suggestive steps to reduce the unorganised sector for more productive",
            "contributions to GDP.",
            "⮚ Enumerate and infer the essential role of the Public and Private sectors",
            "Chapter 3- Money and Credit",
            "Learning Outcome- The students will be able to",
            "⮚ Enumerate how money plays as a medium exchange in all transactions of goods and",
            "services from ancient times to the present times.",
            "⮚ Analyse and infer various sources of Credit.",
            "⮚ Summarise the significance and role of self-help groups in the betterment of the economic",
            "condition of rural people/ women.",
            "Chapter- 4. Globalisation and the Indian Economy",
            "Subtopics: What is Globalisation?",
            "Factors that have enabled Globalisation.",
            "Interdisciplinary Project with chapter 3 of History: “The making of a Global World”. And chapter",
            "7 of Geography: “Lifelines of National Economy”",
            "Subtopics:",
            "i. Production across the countries",
            "ii. World Trade Organisation",
            "iii. The Struggle for a Fair Globalisation",
            "Refer Annexure III-B",
            "Learning Outcome- The students will be able to",
            "⮚ Enumerate the concept of globalisation and its definition, evolution, and impact on the global",
            "economy.",
            "⮚ Evaluate the key role of the key major drivers of globalisation and their role in shaping the",
            "global economic landscape in various countries.",
            "⮚ Comprehend the significance of role of G20 and its significance in the light of India's role.",
            "5. Project work - Consumer Rights OR Social Issues OR Sustainable Development",
            "Learning Outcome- Refer Annexure III",
            "17",
            "CLASS X (2025-26)",
            "MAP WORK",
            "Subject Name of the Chapter List of areas to be located/ labeled/ identified on",
            "the map",
            "History Nationalism in India I. Congress sessions:",
            " 1920 Calcutta",
            " 1920 Nagpur",
            " 1927 Madras session",
            "II. 3 Satyagraha movements:",
            " Kheda",
            " Champaran",
            " Ahmedabad mill workers",
            "III. Jallianwala Bagh",
            "IV. Dandi March",
            "Geography Resources and Identify Major Soil Types",
            "Development",
            "Water Resources Locating and Labeling:",
            " Salal  Sardar Sarovar",
            " Bhakra Nangal  Hirakund",
            " Tehri  Nagarjun Sagar",
            " Rana Pratap Sagar  Tungabhadra",
            "Agriculture Identify:",
            " Major areas of Rice and Wheat",
            " Largest/Major producer states of Sugarcane, Tea,",
            "Coffee,",
            " Rubber, Cotton and Jute",
            "Minerals and Energy Identify:",
            "Resources Iron Ore Mines Coal Mines Oil Fields",
            "Mayurbhanj Raniganj Digboi",
            "Durg Bokaro",
            "Naharkatia",
            "Bailadila Talcher",
            "Mumbai High",
            "Bellary Neyveli",
            "Bassien",
            "Kudremukh",
            "Kalol",
            "Ankaleshwar",
            "Locate and label: Power Plants",
            "Thermal Nuclear",
            " Namrup  Narora",
            " Singrauli  Kakrapara",
            " Ramagundam  Tarapur",
            " Kalpakkam",
            "18",
            "Manufacturing",
            " Manufacturing Industries (Locating and labeling",
            "Industries",
            "only)",
            " Cotton textile Industries: a. Mumbai, b. Indore,",
            "c. Surat, d. Kanpur, e. Coimbatore",
            " Iron and Steel Plants: a. Durgapur, b. Bokaro, c.",
            "Jamshedpur, d. Bhilai, e. Vijayanagar, f. Salem",
            " Software technology Parks: a. Noida, b. Gandhi-",
            "nagar, c. Mumbai, d. Pune, e. Hyderabad,",
            "f. Bengaluru, g. Chennai,h. Thiruvananthapuram",
            "Lifelines of National Locating and Labeling",
            "Economy",
            "a. Major Sea Ports",
            "• Kandla • Tuticorin",
            "• Mumbai • Chennai",
            "• Marmagao • Visakhapatnam",
            "• New Mangalore • Paradip",
            "• Kochi • Haldia",
            "b. International Airports",
            " Amritsar (Raja Sansi-Sri Guru Ram Das ji)",
            " Delhi (Indira Gandhi)",
            " Mumbai (Chhatrapati Shivaji)",
            " Chennai (Meenambakkam)",
            " Kolkata (Netaji Subhash Chandra Bose)",
            " Hyderabad (Rajiv Gandhi)",
            "Note",
            "1. Items of Locating and Labelling may also be given for Identification.",
            "2. The Maps available in the website of Govt. of India may be used.",
            "19",
            "CLASS X",
            "QUESTION PAPER DESIGN",
            "Subject Wise Weightage",
            "Subject Syllabus Marks Percentage",
            "(80)",
            "History  The Rise of Nationalism in Europe.",
            " Nationalism in India:",
            "18+2 25%",
            " The Making of a Global World Sub topics 1 to 1.3",
            " Print Culture and the Modern World",
            " Map pointing",
            "Political  Power – sharing",
            "Science",
            " Federalism",
            "20 25%",
            " Gender, Religion and Caste",
            " Political Parties",
            " Outcomes of Democracy",
            "Geography",
            " Resources and Development",
            " Forest and Wildlife Resources",
            " Water Resources",
            "17+3 25%",
            " Agriculture",
            " Mineral& Energy resources",
            " Manufacturing industries.",
            " Lifelines of National Economy (map pointing)",
            " Map pointing",
            "Economics",
            " Development",
            " Sectors of the Indian Economy",
            " Money and Credit 20 25%",
            " Globalisation and The Indian Economy",
            "Sub topics:",
            " What is Globalisation?",
            " Factors that have enabled Globalisation",
            "20",
            "Weightage to Type of Questions",
            "Type of Questions Marks Percent",
            "(80) age",
            "1 Mark- MCQs (20x1) 20 25%",
            "(Inclusive Of Assertion, Reason, Differentiation & Stem)",
            "2 Marks- Long Answer Questions (4x2) 10%",
            "(Knowledge, Understanding, Application, Analysis, 8",
            "Evaluation, Synthesis & Create)",
            "3 Marks- Long Answer Questions (5x3) 15 18.75%",
            "(Knowledge, Understanding, Application, Analysis,",
            "Evaluation, Synthesis & Create)",
            "4 Marks- Case Study Questions (3x4) (Knowledge, 15%",
            "Understanding, Application, Analysis, Evaluation, Synthesis 12",
            "& Create)",
            "5 Mark- Long Answer Questions (4x5) 20 25%",
            "(Knowledge, Understanding, Application, Analysis,",
            "Evaluation, Synthesis & Create)",
            "Map Pointing 5 6.25%",
            "Weightage to Competency Levels",
            "Sr. No. Competencies Marks Percent-",
            "(80) age",
            "1 Remembering and Understanding: Exhibiting memory of",
            "previously learned material by recalling facts, terms, basic 24 30%",
            "concepts, and answers; Demonstrating understanding of",
            "facts and ideas by organizing, translating, interpreting,",
            "giving descriptions and stating main ideas.",
            "2 Applying: Solving problems to new situations by applying",
            "11 13.25%",
            "acquired knowledge, facts, techniques",
            "and rules in a different way.",
            "3 Analysing, Evaluating and Creating:",
            "Examining and breaking information into parts by",
            "identifying motives or causes; Making inferences and",
            "40 50%",
            "finding evidence to support generalizations; Presenting",
            "and defending opinions by making judgments about",
            "information, validity of ideas, or quality of work based on a",
            "set of criteria.",
            "Compiling information together in a different way by",
            "combining elements in a new pattern or",
            "proposing alternative solutions.",
            "4 Map Skill 5 6.25%",
            "Total",
            "80 100%",
            "21",
            "CLASS X (2025-26)",
            "GUIDELINES FOR INTERNAL ASSESSMENT: 20 MARKS",
            "Type of Assessment Description Marks",
            "Periodic Assessment Pen Paper Test. 5",
            "Multiple Assessment Quiz, debate, role play, viva, group discussion, visual",
            "expression, interactive bulletin boards, gallery walks, 5",
            "exit cards, concept maps, peer assessment, Self-",
            "assessment etc. through Interdisciplinary project",
            "Subject Enrichment Project Work on Consumer Rights OR Social Issues OR 5",
            "Activity Sustainable Development (Interdisciplinary)",
            "Portfolio Classwork, Work done (activities/ assignments) 5",
            "reflections, narrations, journals, etc. Achievements of",
            "the student in the subject throughout the year",
            "Participation of the student in different activities like",
            "heritage India quiz",
            "CLASS X",
            "PRESCRIBED TEXTBOOKS",
            "S.No. Subject Name of the Book Publisher",
            "1 History India and the Contemporary World-II NCERT",
            "2 Political Science Democratic Politics-II NCERT",
            "3 Geography Contemporary India-II NCERT",
            "4 Economics Understanding Economic Development NCERT",
            "5 Disaster Management Together, towards a safer India- Part III CBSE",
            "22",
            "ANNEXURE I",
            "Project work Competencies",
            "Every student must undertake one project on Disaster The students will develop the",
            "Management following competencies:",
            "Objectives: The main objectives of giving project work on  Collaboration",
            "Disaster Management to the students are to:",
            " Use analytical skills.",
            " To create awareness in them about different disasters, their",
            "consequences and management  Evaluate the situations",
            "during disasters.",
            " To prepare them in advance to face such situations",
            " Synthesize the information.",
            " To ensure their participation in disaster risk reduction plans",
            " Find creative solutions.",
            " To enable them to create awareness and preparedness",
            "among the community.  Strategies the order of",
            "solutions.",
            " The project work helps in enhancing the Life Skills of the",
            "students.",
            " Use the right",
            " Various forms of art must be integrated in the project work. communication skills.",
            "Guidelines:",
            "To realise the expected objectives, it would be required of the principals / teachers to muster",
            "support from various local authorities and organisations like the Disaster Management",
            "Authorities, Relief, Rehabilitation and the Disaster Management Departments of the States,",
            "Office of the District Magistrate/ Deputy Commissioners, Fire Service, Police, Civil Defence etc.",
            "in the area where the schools are located.",
            "The project carried out by the students should subsequently be shared among themselves",
            "through interactive sessions such as exhibitions, panel discussions, etc.",
            "The distribution of marks over different rubrics relating to Project Work is as follows:",
            "S.no Aspects Mar",
            "ks",
            "a Content accuracy and originality 2",
            "b Competencies exhibited and Presentation 2",
            "c Viva-Voce 1",
            "⮚ All documents pertaining to assessment under this activity should be meticulously maintained",
            "by the schools.",
            "⮚ A Summary Report should be prepared highlighting:",
            " objectives realized through individual work and group interactions.",
            " calendar of activities.",
            " innovative ideas generated in the process.",
            " list of questions asked in viva voce.",
            "23",
            "⮚ It is to be noted here by all the teachers and students that the projects and models prepared",
            "should be made from eco-friendly products without incurring too much expenditure.",
            "⮚ The Project Report can be handwritten or digital.",
            "⮚ The Project Work needs to enhance cognitive, affective and psychomotor skills of the learners.",
            "It will include self-assessment and peer assessment, and progress of the child in project-based",
            "and inquiry-based learning, art integrated activities, experiments, models, quizzes, role plays,",
            "group work, portfolios, etc., along with teacher assessment. (NEP-2020)",
            "⮚ The Project work can culminate in the form of PowerPoint",
            "Presentation/Exhibition/Skit/albums/files/song and dance or culture show /story",
            "telling/debate/panel discussion, paper presentation and whichever is suitable to Visually",
            "Impaired Candidates.)",
            "⮚ The record of the project work (internal assessment) should be kept for a period of three",
            "months for verification, if any.",
            "24",
            "ANNEXURE II",
            "Class-IX",
            "Interdisciplinary Project",
            "Subject and Name of the Suggested Teaching Learning Time",
            "Chapter No Chapter Learning Process Outcomes Schedule For",
            "with Specific Completion",
            "Competencies",
            "History Forest Society Interdisciplinary project Compare the forest The schools",
            "Chapter and Teachers can make use of situations prevailed to do IDP",
            "IV Colonialism the pedagogies in in the pre- colonial, between the",
            "facilitating the students in colonial and post- months of",
            "completion of colonial era. April and",
            "Interdisciplinary Project September",
            "Constructivism Inquiry Evaluate the growth at the",
            "based learning Cooperative &role of commercial School",
            "Learning Research based forestry in different under the",
            "learning. Experiential types of Vegetation. guidance of",
            "learning. a teacher.",
            "Art integration Analyse the reasons (Carryover",
            "for rebellions in of project to",
            "Multiple Assessment: Ex.",
            "forest areas of south home must",
            "Surveys / Interviews /",
            "East-Asia with be strictly",
            "Research work/",
            "specification to avoided)",
            "Observation/ Story based",
            "JAVA.",
            "Presentation/ Art",
            "integration/ Quiz/ Debate/",
            "To defend the role of",
            "role play/ viva, /group",
            "government and the",
            "discussion, /visual",
            "local communities in",
            "expression/ interactive",
            "protecting the forest",
            "bulletin boards/ gallery",
            "cover.",
            "walks/ exit cards/ concept",
            "maps/ peer assessment/ art",
            "integration /Self-",
            "assessment/ integration of",
            "technology etc.",
            "Geography Natural To devise ways to",
            "Chapter 5 Vegetation protect the forest",
            "and Wildlife vegetation and",
            "wildlife in India.",
            "Guidelines for Interdisciplinary Project:",
            "It involves combining 2 or more disciplines into one activity-more coherent and integrated. The",
            "generally recognized disciplines are economics, History, Geography, Political Science. A sample",
            "plan has been enclosed. Kindly access the link given below-",
            "https://docs.google.com/document/d/1668TKkRt80r4-kbjJ_Y7zg4mF3Vq1Y9k/edit",
            "Plan of the project:",
            "A suggestive 10 days’ plan given below which you may follow, or you can create on your own, based",
            "on the templates provided below.",
            "Process:",
            "Initial collaboration among students to arrange their roles, areas of integration, area of",
            "investigation and analysis, roles of students.",
            "25",
            "Team leader: Main collaborator",
            "Team members:",
            "Note: Teacher to allocate the roles as per the abilities of the students.",
            " Final submission based on course deliverables as given in the template below the 10-day",
            "plan.",
            " Assessment Plan: to be done by the teacher clearly mentioning the Rubrics.",
            " Report, poster and video acknowledgements: reflections & expression of gratitude as",
            "given in the template given below",
            "10 days suggestive plan 10 periods",
            "Day 1-2: Colonialism and Forest Society",
            "Discuss the impact of colonialism on forest societies and explore the concept of forest as a",
            "resource in colonialism. Group project: Research and present a PPT on the colonial forest",
            "policy and its impact on forest societies.",
            "Day 3-4: \"Rebellion in the Forest\"",
            "Analyse the causes and effects of forest-based rebellions in history. Watch the following film",
            "Group discuss about forest tribes of your state and the exploitations they face. Refer",
            "Annexure V for Rubrics. https://www.youtube.com/watch?v=N6SR0REa_YA",
            "Day 5-6: Forest Transformations in Java, Tropical Evergreen Forests",
            " Examine the impact of human activity on forests in Java.",
            " Explore how changes in land use, agriculture, and industry have impacted the forests.",
            "Students can research the history of forest transformations in Java and their impact on",
            "the environment.",
            " Study the transformation of forests in Java, from pre-colonial to post-colonial times.",
            "Compare and contrast the conversion of forest into agricultural land and the need.",
            "Through group discussions find solutions. Present an art integrated project.",
            " Discuss the characteristics of tropical evergreen forests, including their climate, soil, and",
            "flora/fauna.",
            " Students can research specific examples of tropical evergreen forests and the",
            "challenges they face, such as deforestation and climate change.",
            "Group project: watch the video through the link https://www.youtube.com/watch?v=Ml0xvHsBigI",
            " Analyse and present the impact of forest transformations on society, economy and",
            "environment in Java. Compare and contrast it with India.",
            " Present a PPT of your learnings. Refer Annexure V for rubrics",
            "Day 7-8: Discuss how colonialism has affected the forest's biodiversity and the survival of",
            "indigenous communities living in and around the forest",
            "Group activity: Divide the group into smaller teams and assign them tasks related to",
            "identifying the impact of colonialism on different types of forests. For example, one team can",
            "research the impact of colonialism on forest fires, while another team can research the",
            "impact of colonialism on the survival of indigenous plants and animals. Make the students",
            "use cartoon strips to present their findings. Day 9-10: Make the students compile all the",
            "findings of 8 days’ work and present them in PPT and through the template given in Annexure",
            "IV.",
            "26",
            "Annexure III-A",
            "Name of the Students (Team):",
            "Class : Section:",
            "Topics of Interdisciplinary",
            "Project:",
            "Title of the Project:",
            "Objectives:",
            "Multiple Assessment:",
            "Ex. Surveys / Interviews / Research work/ Observation/ Story based Presentation/ Art integration/",
            "Quiz/ Debate/ role play/ viva, /Group discussion /visual expression/ interactive bulletin boards/",
            "gallery walks/ exit cards/ concept maps/ peer assessment/ art integration /Self-assessment/",
            "integration of technology etc.",
            "Evidences: Photos, Excerpts from Interviews, observations, Videos, Research References, etc.",
            "Overall presentation: Link of PPT, shared documents, can be digital/handwritten, as per the",
            "convenience of the school.",
            "Acknowledgement:",
            "References",
            "(websites, books, newspaper",
            "etc.)",
            "Reflections:",
            "ANNEXURE V",
            "Rubrics for Interdisciplinary Project",
            "Rubrics Marks allocated",
            "Research Work 1",
            "Collaboration & Communication 1",
            "Presentation & Content relevance 1",
            "Competencies- Creativity, Analytical skills, 2",
            "Evaluation, Synthesizing,",
            "Total 5",
            "33"
        ]
    },
    "10th": {
        "Science": [
            "Science (086)",
            "Theory (80 marks)",
            "Competencies Total",
            "Demonstrate Knowledge and Understanding 50 %",
            "Application of Knowledge/Concepts 30 %",
            "Formulate, Analyze, Evaluate and Create 20 %",
            "Note:",
            " Typology of Questions: VSA including objective type questions, Assertion –",
            "Reasoning type questions; SA; LA; Source-based/ Case-based/ Passage-based/",
            "Integrated assessment questions.",
            " An internal choice of approximately 33% would be provided.",
            "Internal Assessment (20 Marks)",
            " Periodic Assessment - 05 marks + 05 marks",
            " Subject Enrichment (Practical Work) - 05 marks",
            " Portfolio - 05 marks",
            "Suggestive verbs for various competencies",
            " Demonstrate Knowledge and Understanding",
            "State, name, list, identify, define, suggest, describe, outline, summarize, etc.",
            " Application of Knowledge/Concepts",
            "Calculate, illustrate, show, adapt, explain, distinguish, etc.",
            " Formulate, Analyze, Evaluate and Create",
            "Interpret, analyze, compare, contrast, examine, evaluate, discuss, construct, etc.",
            "13"
        ],
        "Social": [
            "10 periods 5 marks",
            "Every student must undertake one project on … The students will develop",
            "the following",
            "Consumer Awareness OR Social Issues OR Sustainable",
            "competencies:",
            "Development",
            " Collaboration",
            "Objectives:",
            " The objective of the project work is to help students gain an  Use analytical skills.",
            "insight and pragmatic understanding of the theme and see all",
            " Evaluate the situations",
            "the Social Science disciplines from an interdisciplinary",
            "during disasters.",
            "perspective.",
            " Synthesize the",
            " It should also help in enhancing the Life Skills of the students.",
            "information.",
            " Students are expected to apply the Social Science concepts that  Find creative solutions.",
            "they have learnt over the years to prepare the project report",
            " Strategies the order of",
            " If required, students may go out for collecting data and use solutions",
            "different primary and secondary resources to prepare the  Use right",
            "project. communication skills",
            " If possible, various forms of art may be integrated in the project",
            "work.",
            "Guidelines:",
            "The distribution of marks over different rubrics relating to Project Work is as follows:",
            "S.no Rubrics Marks",
            "a Content accuracy and originality 2",
            "b Competencies exhibited and Presentation 2",
            "c Viva-Voce 1",
            "The project carried out by the students should subsequently be shared among themselves",
            "through interactive sessions such as exhibitions, panel discussions, etc.",
            "1. All documents pertaining to assessment under this activity should be meticulously maintained",
            "by the schools.",
            "2. A Summary Report should be prepared highlighting:",
            " objectives realized through individual work and group interactions.",
            " calendar of activities.",
            " innovative ideas generated in the process",
            " list of questions asked in viva voce.",
            "3. It is to be noted here by all the teachers and students that the projects and models prepared",
            "should be made from eco-friendly products without incurring too much expenditure.",
            "4. The Project Report can be handwritten or digital.",
            "5. The Project Work needs to enhance cognitive, affective and psychomotor skills of the",
            "learners. It will include self-assessment and peer assessment, and progress of the child in",
            "project-based and inquiry-based learning, art integrated activities, experiments, models,",
            "quizzes, role plays, group work, portfolios, etc., along with teacher assessment. (NEP- 2020)",
            "27",
            "6. Must be done at school only as specific periods are allocated for project work.",
            "7. The Project work can culminate in the form of Power Point Presentation/ Exhibition/ Skit/",
            "albums/files/song and dance or culture show/story telling/debate/panel discussion, paper",
            "presentation and whichever is suitable to Visually Impaired Candidates.",
            "8. Records pertaining to projects (internal assessment) of the students will be maintained for a",
            "period of three months from the date of declaration of result for verification at the discretion",
            "of the Board. Subjudice cases, if any or those involving RTI / Grievances may however be",
            "retained beyond three months.",
            "B",
            "Subject and Name of Suggested Teaching Learning Outcomes Time Schedule",
            "Chapter No. the Learning Process with Specific For",
            "Competencies",
            "Chapter Completion",
            "History Making of a The teachers may use ⮚ Analyse the The schools",
            "Chapter III Global World the following implication of do IDP",
            "pedagogies in globalisation for local between the",
            "facilitating the economies. months of",
            "students in completion April and",
            "⮚ Discuss how",
            "of Interdisciplinary globalisation is September at",
            "Project. experienced the School",
            "1) Constructivism differently by under the",
            "Geography Lifelines of 2) Inquiry based different social guidance of a",
            "Chapter 7 National learning groups. Enumerates teacher.",
            "Economy 3) Cooperative how transportation (Carryover of",
            "learning works as a lifeline of project to",
            "4) Learning station the economy. home must",
            "5) Collaborative be strictly",
            "⮚ Analyse and infer",
            "learning avoided)",
            "the impact of",
            "6) Videos/ Visuals/",
            "roadways and",
            "documentaries/ railways on the",
            "movie clippings national economy.",
            "7) Carousel technique",
            "⮚ Analyses and infers",
            "8) Art integrated",
            "the challenges faced",
            "learning Group",
            "by the roadways and",
            "Discussions",
            "railway sector in",
            "Multiple",
            "India",
            "Assessment:Ex.",
            "Surveys/",
            "Interviews/",
            "Research work/",
            "Observation/ Story",
            "based",
            "Economics Globalisation Presentation/ Art ⮚ Integrate various",
            "Chapter 4 on and the integration/ Quiz/ dimensions of",
            "Indian Debate/ role play/ globalisation in",
            "Economy viva, /group terms of cultural /",
            "discussion, /visual political/ social",
            "expression/ /economical",
            "interactive bulletin aspects)",
            "28",
            "boards/ gallery walks/ ⮚ Appraise the",
            "exit cards/ concept evolution of",
            "maps/ peer Globalisation and",
            "assessment/ art the global trends",
            "integration /Self -",
            "⮚ Investigate the",
            "assessment/integrati factors that",
            "on of technology etc. facilitated the",
            "growth on MNC ‘s",
            "Guidelines:",
            " It involves combining 2 or more disciplines into one activity-more coherent and integrated.",
            "The generally recognized disciplines are economics, History, Geography, Political Science,",
            "a sample plan has been enclosed) Kindly access the link given below",
            " Methodology (A sample interdisciplinary project plan Link has been provided to get an insight",
            "about IDP.",
            " Topic: The Making of a Global World, Globalisation and Lifelines of Economy",
            "https://docs.google.com/document/d/1dIwwFeaSrExJHMtkzcEuoq3ehh-7FtHM/edit",
            "Plan of the project:",
            "A suggestive 10 days’ plan given below which you may follow, or you can create on your own,",
            "based on the templates provided below",
            "Process:",
            "Initial collaboration among students to arrange their roles, areas of integration, area of",
            "investigation and analysis, roles of students",
            "Interdisciplinary Project",
            "Day 1: Introduction to the Interdisciplinary Project and Setting the Context:",
            "Brief overview of the project and its objectives to be given by the teachers.",
            "History teacher to Introduce the historical context of World War II and its aftermath through",
            "inquiry methods.",
            "Make the students to Group discuss the impact of World War II on the global economy.",
            "Teacher to refer annexure III for rubrics)",
            "Day 2: The Great Depression:",
            "Students to watch a video from the link, https://www.youtube.com/watch?v=62DxELjuRec and",
            "https://www.youtube.com/watch?v=gqx2E5qIV9s and discuss the causes and consequences of",
            "the Great Depression and the role of mass production and consumption in the Great",
            "Depression. Present a group PPT /report on consequences of the Great Depression on the",
            "global economy.",
            "Day 3: India and the Great Depression:",
            "Students to collect material related to India’s economic condition during the Great Depression",
            "and relate it to the present economic condition of India and US. Students may collect",
            "information through a visit to the library.",
            "As a group activity they need to present a collage of their findings. (Refer Annexure V for",
            "29",
            "Rubrics)",
            "Day 4: Rebuilding the World Economy and Interlinking Production across countries",
            " Teachers to use Jigsaw method to make the students to sit in groups and to give each group a",
            "part of the handout with information about process taken to rebuild economy and how the",
            "production across countries got interlinked. Make the groups to compile the information by",
            "moving from group to group.",
            " Make them discuss the post-war recovery efforts and their impact on the global economy",
            " Study the role of the Bretton Woods Institutions in rebuilding the world economy and present",
            "their learnings through Art Integrated Project. Refer Annexure V for rubrics.",
            "Day 5: The Early Post-War Years: The role of roadways, railways, waterways and airways",
            "in building the national economy",
            " The teacher distributes the Handout 1 given below to the groups and asks them to find",
            "answers to the questions posed at the end of Hand out and present it in groups using Café",
            "conversations mode. Refer Annexure III for rubrics.",
            " Study the challenges faced by the world in the early post-war years",
            "Day 6: Post war settlement and Bretton Woods institutions",
            "● Make the students read the material available online/in library and debate the impact of",
            "Bretton Woods institutions in the post war economy. Refer Annexure V for Rubrics.",
            "Day 7: Decolonization and Independence - The Role of World Trade Organization:",
            " The students will read the handout 2 given below and present a role play of the support",
            "rendered by the World Trade Organisation in building new nations. Refer Annexure V for",
            "rubrics",
            " Introduction to the World Trade Organization",
            " Study the role of the WTO in promoting fair trade practices",
            " Discuss the efforts made towards decolonization and independence of nations",
            "Day 8: End of Bretton Woods and the Beginning of Globalisation:",
            "● The students will read material given in the link",
            "https://www.imf.org/external/about/histend.htm#:~:text=End%20of%20Bretton% 20Woods",
            "%20system,-The%20system%20 dissolved&text=In% 20August% 201971 %2C%20U.S.",
            "%20Pr esident,the%20breakdown%20of%20the%20syste m.",
            "● Organise an interview with a financial expert/economist/ lecturer/professor. Based on the",
            "information they gathered, the students can submit a report on the findings.",
            "● Discuss the reasons for the end of the Bretton Woods system",
            "Day 9: Impact of Globalization in India and role of waterways and airways",
            "https://www.jagranjosh.com/general-knowledge/new-economic-policy-of-1991-objectives-",
            "features-and-impacts-1448348633-1",
            "● The students will read the material given in the above link and design a report on what would",
            "have happened to India if this stand wasn’t taken and present it as a radio talk show. They",
            "will link the role of waterways and airways in the achievement of India in globalisation.",
            "● Study the impact of globalisation on the Indian economy",
            "● Discuss the challenges faced by India in the process of globalisation",
            "Day 10. Final presentation",
            "Conclude the interdisciplinary project and summarize the key takeaways.",
            "30",
            "Title: The Role of Waterways and Airways in Post-World War II- World and India",
            "Introduction: After the end of World War II, the world faced significant economic, social, and political",
            "changes. The role of waterways and airways in shaping the post-war world and India is crucial to",
            "understand. In this handout, we will discuss the impact of waterways and airways on the global",
            "economy and how it helped India in its development.",
            "Waterways: In the post-World War II era, waterways played a crucial role in the movement of",
            "goods and people. The improvement of ports and waterways allowed for more efficient",
            "transportation of goods and helped to spur economic growth.",
            "The increased demand for goods and services, combined with the development of shipping",
            "technologies, allowed for the expansion of international trade. This helped to boost the world",
            "economy and allowed for the growth of industries in many countries, including India.",
            "In India, the development of waterways and ports helped to improve the country's economy. The",
            "country's long coastline and several rivers made it an ideal location for the transportation of goods.",
            "The growth of ports and waterways in India allowed for the movement of goods from one part of",
            "the country to another, helping to spur economic growth and development.",
            "Airways: After World War II, the development of air transportation revolutionized the world's",
            "economy. The expansion of air travel allowed for faster and more efficient transportation of goods",
            "and people, which helped to boost the world economy.",
            "In India, the growth of airways helped to connect different parts of the country and made it easier",
            "for people and goods to move from one place to another. This helped to spur economic growth",
            "and development in India.",
            "The growth of air transportation in India also allowed for the expansion of international trade.",
            "Indian businesses could now easily access foreign markets, which helped to boost the country's",
            "economy.",
            "Conclusion:",
            "The role of waterways and airways in the post-World War II world and India was crucial in shaping",
            "the economic and social landscape of these countries. The development of these transportation",
            "modes helped to spur economic growth and allowed for the expansion of international trade.",
            "Understanding the impact of waterways and airways on the world and India is crucial in",
            "understanding the economic and social changes that took place after World War II.",
            "Questions:",
            "1. Mention the role of major ports in imports and exports.",
            "2. Emergence of Deccan airways changed the entire functionalities of domestic airways.",
            "Substantiate the statement",
            "3. The waterways and airways contribute to the economic growth of India. Substantiate your",
            "answer.",
            "31",
            "Title The Role of the World Trade Organization (WTO) in Building New Nations Post-",
            "Colonialization",
            "Introduction: After the end of colonialism, many countries faced significant economic and political",
            "challenges as they worked to establish themselves as independent nations. The World Trade",
            "Organization (WTO) played a crucial role in helping these countries to rebuild their economies and",
            "participate in the global economy. In this handout, we will discuss the role of the WTO in building",
            "new nations post- colonialization.",
            "What is the WTO?",
            "The WTO is an international organization that was established in 1995 to promote international trade",
            "and help countries participate in the global economy.",
            "The WTO provides a forum for countries to negotiate and enforce international trade agreements",
            "and helps to ensure that trade is conducted in a fair and predictable manner. The organization also",
            "provides technical assistance and advice to help countries improve their trade policies and",
            "participate in the global economy.",
            "How has the WTO helped new nations post-colonialization?",
            "After colonial rule ended, many countries faced significant economic challenges as they worked to",
            "establish themselves as independent nations. The WTO helped these countries to participate in",
            "the global economy by providing a forum for trade negotiations and by helping to enforce",
            "international trade agreements.",
            "The WTO also provided technical assistance and advice to help these countries improve their trade",
            "policies and participate in the global economy. This helped to spur economic growth and",
            "development in these countries and allowed them to become more integrated into the global",
            "economy.",
            "By participating in the global economy, new nations post-colonialisation was able to expand their",
            "markets, attract foreign investment, and improve their economic performance. The WTO played a",
            "crucial role in helping these countries to build their economies and establish themselves as stable,",
            "independent nations.",
            "Conclusion:",
            "The WTO played a crucial role in building new nations post-colonialization by helping these",
            "countries to participate in the global economy. The organization's trade negotiations, enforcement",
            "of international trade agreements, and technical assistance helped to spur economic growth and",
            "development in these countries. Understanding the role of the WTO in building new nations post-",
            "colonialization is important in understanding the economic and political changes that took place",
            "after the end of colonial rule.",
            "32",
            "ANNEXURE IV"
        ]
    }
}
